//質問を呼び出す時に使う
var random = Math.floor(Math.random() * 10);

//運勢に使う
var unsei = Math.floor(Math.random() * 5);

//質問の配列準備
var qtn = new Array();

//質問集
qtn[0] = "好きな食べ物は何ですか？";
qtn[1] = "今の天気はどうですか？";
qtn[2] = "ご飯何食べましたか？";
qtn[3] = "今暑いですか？寒いですか？";
qtn[4] = "今日のあなたのファッション決まっていますか？";
qtn[5] = "あなたの好きな異性のタイプは何ですか？";
qtn[6] = "あなたの運勢を占います。";
qtn[7] = "あなたの好きなゲームは何ですか？"
qtn[8] = "目玉焼きにかけるならなにかける？"
qtn[9] = "君は日本語意外に何語で話せますか？"

//質問を表示するメソッドです。触れるべからず！！
function question(){
	document.write(qtn[random]);
}

//返答用のメソッド
function dispTextarea(){
	var tarea  = document.fm.tarea.value;
	
	switch(random){
/*-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------*/
		case 0:
		document.getElementById("text").innerHTML = tarea+"ですか。おいしいですよね！"+"<br>"+"僕は電気ばっかり食べてますよ！";
		break;
/*-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------*/
		case 1:
		document.getElementById("text").innerHTML = "そうですか。こっちは0ときどき1ですね。";

		break;
/*-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------*/
		case 2:
		document.getElementById("text").innerHTML = tarea+"ですか。おいしいですよね！"+"<br>"+"僕は電気ばっかり食べてますよ！";

		break;
/*-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------*/
		case 3:
		if(tarea == "寒い"){
		document.getElementById("text").innerHTML = tarea+"ですか。今は重い処理をしていないので、僕も寒いです。";
	}else{
		document.getElementById("text").innerHTML = "そうですか。今は重い処理をしていないので、僕は寒いです。";
	}
		break;
/*-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------*/
		case 4:
		if(tarea == "はい"){
			document.getElementById("text").innerHTML = "そうですか。あなたはナルシストなんですね。";
		}
		else if(tarea == "いいえ"){
			document.getElementById("text").innerHTML = "そうですか。あなたは謙虚ですね。";
		}
		else{
			document.getElementById("text").innerHTML = "そうですね。";
	　		}
	　		
	　	break;
/*-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------*/
		case 5:
			document.getElementById("text").innerHTML = "へー";

		break;
/*-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------*/
		case 6:
		if(unsei == 0){
			document.getElementById("text").innerHTML = "大吉です！！おめでとうございます！";
			img.src ="img/result_lose.png";
		}
		else if(unsei == 1){
			document.getElementById("text").innerHTML = "中吉です！";
			img.src ="img/result_lose.png";
		}
		else if(unsei == 2){
			document.getElementById("text").innerHTML = "小吉です。";
			img.src ="img/result_lose.png";
		}
		else{
			document.getElementById("text").innerHTML = "大凶です。";
			img.src ="img/result_lose.png";
		}
		
		break;
/*-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------*/
		case 7:
			document.getElementById("text").innerHTML = tarea+"ですか。それ知ってるよ！"+"<br>"+"僕もNPCとして一緒にやりたいですね！";
		break;
/*-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------*/
		case 8:
		if(tarea == "ソース"){
			document.getElementById("text").innerHTML = "ソースですか、僕もソース（コード）をかけて食べるんだw";
		}
		else if(tarea == "塩コショウ"){
			document.getElementById("text").innerHTML = "塩コショウも美味しいよね!";
		}
		else if(tarea == "命"){
			document.getElementById("text").innerHTML = "それならお前、命賭けてみろよ!";
		}
		
		else{
			document.getElementById("text").innerHTML = tarea+"もいいよね。";
	　		}
	　		
	　	break;
		
/*-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------*/
		case 9:
		if(tarea == "機械語"){
			document.getElementById("text").innerHTML = "1000101110101010110101010101010"+"<br>"+"（機械語をしゃべれるなんてやるね！）";
		}
		else{
			document.getElementById("text").innerHTML = tarea+"もしゃべれるんですね、すごいですね！";
	　		}
	　		
	　	break;
	}
}